Revit 2026 API

# PathOfTravelUpdateMultiple(Document, IListElementId, IListPathOfTravelCalculationStatus) Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static int UpdateMultiple(
	Document adoc,
	IList<ElementId> elementsToUpdate,
	out IList<PathOfTravelCalculationStatus> resultStatus
)
```
```vb
Public Shared Function UpdateMultiple (
	adoc As Document,
	elementsToUpdate As IList(Of ElementId),
	<OutAttribute> ByRef resultStatus As IList(Of PathOfTravelCalculationStatus)
) As Integer
```
```cpp
public:
static int UpdateMultiple(
	Document^ adoc,
	IList<ElementId^>^ elementsToUpdate,
	[OutAttribute] IList<PathOfTravelCalculationStatus>^% resultStatus
)
```
```fsharp
static member UpdateMultiple :
        adoc : Document *
        elementsToUpdate : IList<ElementId> *
        resultStatus : IList<PathOfTravelCalculationStatus> byref -> int
```

#### Parameters

adoc Document

elementsToUpdate IListElementId

resultStatus IListPathOfTravelCalculationStatus

#### Return Value

Int32

#### Reference

PathOfTravel Class

UpdateMultiple Overload

Autodesk.Revit.DB.Analysis Namespace